Siddbhat/MQTT_-RFID_-UDP_on_ESP8266/MQTT_ESP8266.c
#include <ESP8266WiFi.h>
#include <PubSubClient.h>
#include <SPI.h>
#include <MFRC522.h>
// Update these with values suitable for your network.

const char* ssid = "realme 8 5G";
const char* password = "Amma@0815";
const char* mqtt_server = "91.121.93.94";
//char msg[20];
WiFiClient espClient;
PubSubClient client(espClient);
unsigned long lastMsg = 0;
#define MSG_BUFFER_SIZE	(50)
char msg[MSG_BUFFER_SIZE];

void setup_wifi() 
{
  delay(10);
  // We start by connecting to a WiFi network
  Serial.println();
  Serial.print("Connecting to ");
  Serial.println(ssid);

  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);

  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    Serial.print(".");
  }
  randomSeed(micros());

  Serial.println("");
  Serial.println("WiFi connected");
  Serial.println("IP address: ");
  Serial.println(WiFi.localIP());
}

void callback(char* topic, byte* payload, unsigned int length) {
  Serial.print("Message arrived [");
  Serial.print(topic);
  Serial.print("] ");
  for (int i = 0; i < length; i++) {
    Serial.print((char)payload[i]);
  }
  Serial.println();

  // Switch on the LED if an 1 was received as first character
 /* if ((char)payload[0] == '1') {
    digitalWrite(BUILTIN_LED, LOW);   // Turn the LED on (Note that LOW is the voltage level
    // but actually the LED is on; this is because
    // it is active low on the ESP-01)
  } else {
    digitalWrite(BUILTIN_LED, HIGH);  // Turn the LED off by making the voltage HIGH
  }*/

}    

void reconnect() {
  // Loop until we're reconnected
  while (!client.connected())
   {
    Serial.print("Attempting MQTT connection...");
    // Create a random client ID
    String clientId = "ESP8266Client-";
    clientId += String(random(0xffff), HEX);
    // Attempt to connect
    if (client.connect(clientId.c_str())) {
      Serial.println("connected");
      // Once connected, publish an announcement...
      client.publish("device/yash", "MQTT Server is Connected");
      // ... and resubscribe
      client.subscribe("device/yash");
    } 
    else {
      Serial.print("failed, rc=");
      
      Serial.print(client.state());
      Serial.println(" try again in 5 seconds");
      // Wait 5 seconds before retrying
      delay(5000);
    }
  }
}

void setup() {
  pinMode(BUILTIN_LED, OUTPUT);     // Initialize the BUILTIN_LED pin as an output
  Serial.begin(9600);
  setup_wifi();
  client.setServer(mqtt_server, 1883);
  client.setCallback(callback);
}

void loop() 
{

  if (!client.connected())
  {
    reconnect();
  }
  client.loop();
 /* unsigned long now = millis();
  int yash=0;
  if (now - lastMsg > 2000)
  {
    lastMsg = now;
    if ( Serial.available() ) 
     { // Update and send only after 1 seconds
      String str=Serial.readString();
      for(int i=0;str[i];i++)
      {
        msg[i]=str[i];
        Serial.print(str[i]);
      }
      client.publish("device/yash",msg);
      }
  }*/
    if (Serial.available())
    {
    String str = Serial.readString();
    if (str.length() > 0)
    {
      client.publish("device/yash", str.c_str());
    }
  }
}
